app/controllers/admin/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
    @admin_items = Item.all

INSERT INTO "items" ("id", "title", "content", "score", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @admin_item = current_user.items.build(admin_item_params)

    respond_to do |f|
      if @admin_item.save

DELETE FROM "items" WHERE "items"."id" = $1  [["id", 11564712]]
---
  def destroy
    @admin_item.destroy

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 11564712]]
---
  def set_admin_item
    @admin_item = Item.find(params[:id])