app/views/sync/items/_item.html.erb

      <%= item.score %> points
      by <%= render_link_to_user(item.user) %> <%= link_to "#{time_ago_in_words(item.created_at)} ago", item %>
---
INSERT INTO "items" ("title", "url", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "lol"], ["url", "http://lol.com"], ["content", ""], ["user_id", 6], ["created_at", "2016-04-25 22:34:41.472559"], ["updated_at", "2016-04-25 22:34:41.472559"]]