app/controllers/items_controller.rb

  def index
    order = params[:newest] ? {created_at: :desc} : {rank: :desc}

    @items = Item.order(order).includes(:user)
---
SELECT "items".* FROM "items"  ORDER BY "items"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (2)

  def show
    @comments = @item.comments.includes(:user).order(created_at: :asc)
---
SELECT "item_comments".* FROM "item_comments" WHERE "item_comments"."item_id" = $1  ORDER BY "item_comments"."created_at" ASC  [["item_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (2)

  def create
    @item = current_user.items.build(item_params)

    if @item.save
---
INSERT INTO "items" ("title", "url", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "what is an i-node?"], ["url", "http://nba.com"], ["content", ""], ["user_id", 2], ["created_at", "2016-04-25 09:30:37.385591"], ["updated_at", "2016-04-25 09:30:37.385591"]]

  def set_item
    @item = Item.includes(:votes).find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]

  def set_user_item
    @item = current_user.items.where(id: params[:id]).first
---
SELECT  "items".* FROM "items" WHERE "items"."user_id" = $1 AND "items"."id" = $2  ORDER BY "items"."id" ASC LIMIT 1  [["user_id", 1], ["id", 1]]