app/controllers/item_comments_controller.rb

  def create
    @comment = current_user.item_comments.build(comment_params)
    if @comment.save
---
INSERT INTO "item_comments" ("content", "item_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "An i-node is..."], ["item_id", 1], ["user_id", 2], ["created_at", "2016-04-25 10:22:34.279142"], ["updated_at", "2016-04-25 10:22:34.279142"]]

  def set_item
    @item = Item.find(params[:item_id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]