app/controllers/users_controller.rb

INSERT INTO "users" ("username", "about", "salt", "crypted_password", "created_at", "updated_at", "token") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."username" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["username", "mahmoodn@purdue"]]
---
  def set_user
    @user = User.where(username: params[:id]).first